[
    {
        "id": 1,
        "img": "https://i.ibb.co/vcXjYNC/c.jpg",
        "name": "C",
        "description": "C is a general-purpose, procedural computer programming language supporting structured programming, lexical variable scope, and recursion, with a static type system."
    },
    {
        "id": 2,
        "img": "https://i.ibb.co/3RhccrL/java.jpg",
        "name": "Java",
        "description": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible."
    },
    {
        "id": 3,
        "img": "https://i.ibb.co/WnKzpvW/python.jpg",
        "name": "Python",
        "description": "Python is an interpreted high-level general-purpose programming language. Its design philosophy emphasizes code readability with its use of significant indentation."
    },
    {
        "id": 4,
        "img": "https://i.ibb.co/XV2pmPL/javascript.png",
        "name": "JavaScript",
        "description": "JavaScript, often abbreviated as JS, is a programming language that conforms to the ECMAScript specification. JavaScript is high-level, often just-in-time compiled, and multi-paradigm."
    },
    {
        "id": 5,
        "img": "https://i.ibb.co/N33FnbC/DBMS.png",
        "name": "DBMS",
        "description": "Stands for Database Management System. In short, a DBMS is a database program. ... Some DBMS examples include MySQL, PostgreSQL, Microsoft Access, SQL Server, FileMaker, Oracle, RDBMS, dBASE, Clipper, and FoxPro."
    },
    {
        "id": 6,
        "img": "https://i.ibb.co/2FpLdcQ/eee.jpg",
        "name": "Circuit",
        "description": "An electric circuit is a closed path in which electrons move to produce electric currents. ... It is a very simple concept that incorporates three different components—a source of electrical energy, a device, and a closed loop of conducting material."
    },
    {
        "id": 7,
        "img": "https://i.ibb.co/Lvm9B2q/os.png",
        "name": "OS",
        "description": "An operating system is the most important software that runs on a computer. It manages the computer's memory and processes, as well as all of its software and hardware. It also allows you to communicate with the computer without knowing how to speak the computer's language."
    },
    {
        "id": 8,
        "img": "https://i.ibb.co/SXr6jcc/ai.jpg",
        "name": "AI",
        "description": "Artificial intelligence is the simulation of human intelligence processes by machines, especially computer systems. Specific applications of AI include expert systems, natural language processing, speech recognition and machine vision."
    },
    {
        "id": 9,
        "img": "https://i.ibb.co/4drPH2z/ml.png",
        "name": "ML",
        "description": "Machine learning is an application of artificial intelligence (AI) that provides systems the ability to automatically learn and improve from experience without being explicitly programmed."
    }
]